_posts/2014-11-09-A-hint-system-for-problems-in-org-mode.html
---
title: A hint system for problems in org-mode
date: 2014/11/09 09:55:17
updated: 2014/11/09 09:55:17
categories: org
tags: 
---


<p>
I use org-mode to write problems for classes that I teach. Sometimes it is helpful to be able to provide hints about aspects of the problem. I have used drawers for that before. Here I will look at another approach. The idea is to store a unique id (org-id) in the problem headline. We will make hints somewhere else, and each hint will store the id they refer to in some property. We will run a command in the problem that finds the hints, and offers a menu you can select from.
</p>

<p>
In the next sections, we define a <a href="#sec-1">Problem statement</a>, a section with <a href="#sec-2">hints</a> in it, and finally <a href="#sec-3">code</a> that defines a hint function.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><a id="ID-EE9523FF-C4FF-45D9-BABA-8832A6E48C3B" name="ID-EE9523FF-C4FF-45D9-BABA-8832A6E48C3B"></a><span class="section-number-2">1</span> Problem statement</h2>
<div class="outline-text-2" id="text-1">

<p>
What is the seventh number in the Fibonacci series?
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Hints</h2>
<div class="outline-text-2" id="text-2">
<p>
Hints will be stored in headings somewhere. Here we put them in this file, but they could be stored in another file too. We give each hint a HINT property, with the problem id as the value. Here are three hints. In real example, the hints would not be this easy to find in the document. You might store them somewhere else, in another file for example.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> What is the Fibonacci series?</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The $i<sup>th</sup> number in the Fibonacci series is equal to the sum of the previous two numbers in the series.
</p>
</div>
</div>


<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> What does the series start with?</h3>
<div class="outline-text-3" id="text-2-2">

<p>
The Fibonacci series starts with 1.
</p>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Example of the series.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The Fibonacci series goes as 1, 1, 2, 3, 5, 8, &#x2026;
</p>
</div>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The hint code</h2>
<div class="outline-text-2" id="text-3">
<p>
We want to get the id from the problem the point is in, and then find hints for the problem. Then, we construct a menu and prompt the user to select a hint. I use a number to select the hint because it was easier to generate the menu that way. I like characters better, because you just have to press a key. With numbers you type the number and press enter. We open a new buffer with the contents of the hint in it. You can close the buffer by pressing q.
</p>

<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #8b0000;">defun</span> <span style="color: #8b2323;">hint</span> ()
  <span style="color: #228b22;">"Present a menu of hints for the problem at point"</span>
  (interactive)
  (<span style="color: #8b0000;">let</span> ((id (org-entry-get (point) <span style="color: #228b22;">"ID"</span>))
        (entries '())
        (menu <span style="color: #228b22;">""</span>)
        choice)

    (<span style="color: #8b0000;">unless</span> id
      (<span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #228b22;">"No problem ID found"</span>))

    (org-map-entries
     (<span style="color: #8b0000;">lambda</span> ()
       (<span style="color: #8b0000;">save-restriction</span>
         (org-narrow-to-subtree)
         (add-to-list 'entries
                      (cons
                       (elt (org-heading-components) 4)
                       (buffer-string))
                      t)))
     (format <span style="color: #228b22;">"HINT=\"%s\""</span> id))

    ;; <span style="color: #ff0000; font-weight: bold;">generate menu string</span>
    (<span style="color: #8b0000;">dolist</span> (i (number-sequence 1 (length entries)))
      (setq menu (concat menu (format <span style="color: #228b22;">"[%s] %s\n"</span> (- i 1)
                                      (car (elt entries (- i 1)))))))

    (setq choice (elt entries (read-number (concat menu <span style="color: #228b22;">"Your choice: "</span>) 0)))
    ;; <span style="color: #ff0000; font-weight: bold;">this feels a little clunky. Maybe I could just save a marker to</span>
    ;; <span style="color: #ff0000; font-weight: bold;">the headline, and open it in a narrowed indirect buffer.</span>
    (<span style="color: #8b0000;">when</span> choice
      (switch-to-buffer <span style="color: #228b22;">"*hint*"</span>)
      (erase-buffer)
      (insert (cdr choice))
      
      (org-mode)
      (show-subtree)
      (setq buffer-read-only t)
      (use-local-map (copy-keymap org-mode-map))
      (local-set-key <span style="color: #228b22;">"q"</span> #'(<span style="color: #8b0000;">lambda</span> () (interactive) (kill-buffer)))
      )))
</pre>
</div>
<pre class="example">
hint
</pre>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
This seems like an interesting way to provide hints, or related information in org-mode.  You could also consider using tags, or more sophisticated code  to determine what else is relevant. For example, you might keep track of some performance metric, and use some heuristic algorithm that ranks the related information. Or perhaps fuzzy text searching, or combinations of criteria. If the number of hits got large, then the menu approach here might not be the best one. Then, something like the occur interface might be more suitable.</p>
</div>
</div>
<p>Copyright (C) 2014 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p><p><a href="/org/2014/11/09/A-hint-system-for-problems-in-org-mode.org">org-mode source</a><p><p>Org-mode version = 8.2.7c</p>